[
  {
    "id": "rad_001",
    "input": {
      "report": "08/03/2025, 00:00, MRI TIBIA\n\nCase History:\n\nReason for Request: Pain and reduced mobility in tibia region. Known Paget's disease. Rule out fracture.\n\nFrom clinical notes: Paget'S Disease. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying Paget's disease. A fracture is identified in the tibia region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Laura Bennett, Consultant Radiologist 08/03/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_002",
    "input": {
      "report": "08/12/2025, 00:00, CT SKULL\n\nCase History:\n\nReason for Request: Pain and reduced mobility in skull region. Known vitamin D deficiency with bone demineralization. Rule out fracture.\n\nFrom clinical notes: Vitamin D Deficiency With Bone Demineralization. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying vitamin D deficiency with bone demineralization. A fracture is identified in the skull region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr James Harrison, Consultant Radiologist 08/12/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_003",
    "input": {
      "report": "03/06/2025, 00:00, XR SPINE\n\nCase History:\n\nReason for Request: Follow-up imaging. Post-surgical evaluation.\n\nFindings: Post-operative changes noted. Bones appear intact. No evidence of hardware complication. No pathological fracture. Stable appearance compared to prior.\n\nDr Catherine Reynolds, Consultant Radiologist 03/06/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_004",
    "input": {
      "report": "15/12/2025, 00:00, MRI TIBIA\n\nCase History:\n\nReason for Request: Pain and reduced mobility in tibia region. Known osteoporosis. Rule out fracture.\n\nFrom clinical notes: Osteoporosis. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying osteoporosis. A fracture is identified in the tibia region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr James Harrison, Consultant Radiologist 15/12/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_005",
    "input": {
      "report": "05/03/2025, 00:00, CT SPINE\n\nCase History:\n\nReason for Request: Follow-up imaging. Post-surgical evaluation.\n\nFindings: Post-operative changes noted. Unremarkable skeletal survey. No evidence of hardware complication. No pathological fracture. Stable appearance compared to prior.\n\nDr James Harrison, Consultant Radiologist 05/03/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_006",
    "input": {
      "report": "08/09/2025, 00:00, CT PELVIS\n\nCase History:\n\nReason for Request: Pain and reduced mobility in pelvis region. Known osteoporosis. Rule out fracture.\n\nFrom clinical notes: Osteoporosis. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying osteoporosis. A fracture is identified in the pelvis region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Oliver Matthews, Consultant Radiologist 08/09/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_007",
    "input": {
      "report": "03/08/2025, 09:15, XR CHEST\n\nCase History:\n\nReason for Request: new CVL LIJ Findings: Compared to 01/08/2025. Left IJV CVC projected at the junction with the brachiocephalic vein. ET tube projected slightly high at T1 level. Oesophageal temperature probe in the distal oesophagus. NG tube tip in the stomach. Pacing wires projected across the chest. Right chest drain and mediastinal drain noted. There remains bilateral perihilar bronchial wall thickening with right retrocardiac atelectasis. No measurable residual right pneumothorax. There is some left basal lucency which could reflect a tiny anterior pneumothorax. No significant pleural effusion. Old right posterior ninth rib healing fracture. Distended air filled bowel loops in the visualised upper abdomen. No pneumatosis within the field of view. Dr Michael Chen, Radiology Registrar 03/08/2025, 14:30"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic"
    }
  },
  {
    "id": "rad_008",
    "input": {
      "report": "21/12/2025, 00:00, MRI FEMUR\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: Healing fracture from previous trauma. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Emma Patterson, Consultant Radiologist 21/12/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_009",
    "input": {
      "report": "13/03/2025, 00:00, XR CHEST\n\nCase History:\n\nReason for Request: Pain and reduced mobility in chest region. Known renal osteodystrophy. Rule out fracture.\n\nFrom clinical notes: Renal Osteodystrophy. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying renal osteodystrophy. A fracture is identified in the chest region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Sophie Richardson, Consultant Radiologist 13/03/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_010",
    "input": {
      "report": "06/10/2025, 00:00, XR HUMERUS\n\nCase History:\n\nReason for Request: Trauma assessment. Rule out fracture.\n\nFindings: Unremarkable skeletal survey. No acute bone injury. Soft tissues unremarkable. Joint spaces preserved.\n\nDr Rachel Patel, Consultant Radiologist 06/10/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_011",
    "input": {
      "report": "07/04/2025, 00:00, MRI ANKLE\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: Degenerative changes only. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Laura Bennett, Consultant Radiologist 07/04/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_012",
    "input": {
      "report": "06/04/2025, 00:00, XR CHEST\n\nCase History:\n\nReason for Request: Pain and reduced mobility in chest region. Known hyperparathyroidism. Rule out fracture.\n\nFrom clinical notes: Hyperparathyroidism. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying hyperparathyroidism. A fracture is identified in the chest region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Rebecca Thompson, Consultant Radiologist 06/04/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_013",
    "input": {
      "report": "06/04/2025, 00:00, CT CHEST\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: No evidence of fracture or dislocation. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr James Harrison, Consultant Radiologist 06/04/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_014",
    "input": {
      "report": "18/05/2025, 00:00, MRI HUMERUS\n\nCase History:\n\nReason for Request: Follow-up imaging. Post-surgical evaluation.\n\nFindings: Post-operative changes noted. No acute osseous abnormality. No evidence of hardware complication. No pathological fracture. Stable appearance compared to prior.\n\nDr James Harrison, Consultant Radiologist 18/05/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_015",
    "input": {
      "report": "14/06/2025, 00:00, MRI SPINE\n\nCase History:\n\nReason for Request: Follow-up imaging. Post-surgical evaluation.\n\nFindings: Post-operative changes noted. Stable appearance. No evidence of hardware complication. No pathological fracture. Stable appearance compared to prior.\n\nDr Oliver Matthews, Consultant Radiologist 14/06/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_016",
    "input": {
      "report": "07/05/2025, 00:00, MRI SPINE\n\nCase History:\n\nReason for Request: Pain and reduced mobility in spine region. Known bone metastases. Rule out fracture.\n\nFrom clinical notes: Bone Metastases. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying bone metastases. A fracture is identified in the spine region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr James Harrison, Consultant Radiologist 07/05/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_017",
    "input": {
      "report": "19/10/2025, 00:00, MRI CHEST\n\nCase History:\n\nReason for Request: Pain and reduced mobility in chest region. Known bone metastases. Rule out fracture.\n\nFrom clinical notes: Bone Metastases. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying bone metastases. A fracture is identified in the chest region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Catherine Reynolds, Consultant Radiologist 19/10/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_018",
    "input": {
      "report": "29/12/2025, 00:00, MRI ANKLE\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: No evidence of fracture or dislocation. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Laura Bennett, Consultant Radiologist 29/12/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_019",
    "input": {
      "report": "14/04/2025, 00:00, XR TIBIA\n\nCase History:\n\nReason for Request: Trauma assessment. Rule out fracture.\n\nFindings: Old healed rib fracture. No acute bone injury. Soft tissues unremarkable. Joint spaces preserved.\n\nDr Rachel Patel, Consultant Radiologist 14/04/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_020",
    "input": {
      "report": "06/07/2025, 00:00, CT FEMUR\n\nCase History:\n\nReason for Request: Pain and reduced mobility in femur region. Known hyperparathyroidism. Rule out fracture.\n\nFrom clinical notes: Hyperparathyroidism. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying hyperparathyroidism. A fracture is identified in the femur region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Emma Patterson, Consultant Radiologist 06/07/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_021",
    "input": {
      "report": "01/02/2025, 00:00, XR FEMUR\n\nCase History:\n\nReason for Request: Pain and reduced mobility in femur region. Known Paget's disease. Rule out fracture.\n\nFrom clinical notes: Paget'S Disease. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying Paget's disease. A fracture is identified in the femur region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr James Harrison, Consultant Radiologist 01/02/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_022",
    "input": {
      "report": "28/09/2025, 00:00, CT SKULL\n\nCase History:\n\nReason for Request: Pain and reduced mobility in skull region. Known multiple myeloma. Rule out fracture.\n\nFrom clinical notes: Multiple Myeloma. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying multiple myeloma. A fracture is identified in the skull region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr James Harrison, Consultant Radiologist 28/09/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_023",
    "input": {
      "report": "30/04/2025, 00:00, MRI SHOULDER\n\nCase History:\n\nReason for Request: Pain and reduced mobility in shoulder region. Known renal osteodystrophy. Rule out fracture.\n\nFrom clinical notes: Renal Osteodystrophy. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying renal osteodystrophy. A fracture is identified in the shoulder region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Catherine Reynolds, Consultant Radiologist 30/04/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_024",
    "input": {
      "report": "16/12/2025, 00:00, CT SKULL\n\nCase History:\n\nReason for Request: Follow-up imaging. Post-surgical evaluation.\n\nFindings: Post-operative changes noted. Bones appear intact. No evidence of hardware complication. No pathological fracture. Stable appearance compared to prior.\n\nDr Rachel Patel, Consultant Radiologist 16/12/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_025",
    "input": {
      "report": "04/05/2025, 00:00, MRI SHOULDER\n\nCase History:\n\nReason for Request: Trauma assessment. Rule out fracture.\n\nFindings: No acute osseous abnormality. No acute bone injury. Soft tissues unremarkable. Joint spaces preserved.\n\nDr Emma Patterson, Consultant Radiologist 04/05/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_026",
    "input": {
      "report": "28/06/2025, 00:00, XR SHOULDER\n\nCase History:\n\nReason for Request: Pain and reduced mobility in shoulder region. Known metabolic bone disease. Rule out fracture.\n\nFrom clinical notes: Metabolic Bone Disease. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying metabolic bone disease. A fracture is identified in the shoulder region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Sophie Richardson, Consultant Radiologist 28/06/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_027",
    "input": {
      "report": "04/12/2025, 00:00, MRI SPINE\n\nCase History:\n\nReason for Request: Follow-up imaging. Post-surgical evaluation.\n\nFindings: Post-operative changes noted. Unremarkable skeletal survey. No evidence of hardware complication. No pathological fracture. Stable appearance compared to prior.\n\nDr Michael Chen, Consultant Radiologist 04/12/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_028",
    "input": {
      "report": "13/02/2025, 00:00, MRI ANKLE\n\nCase History:\n\nReason for Request: Pain and reduced mobility in ankle region. Known metabolic bone disease. Rule out fracture.\n\nFrom clinical notes: Metabolic Bone Disease. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying metabolic bone disease. A fracture is identified in the ankle region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Emma Patterson, Consultant Radiologist 13/02/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_029",
    "input": {
      "report": "15/12/2025, 00:00, XR WRIST\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: Healing fracture from previous trauma. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Sarah Mitchell, Consultant Radiologist 15/12/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_030",
    "input": {
      "report": "03/11/2025, 00:00, XR SKULL\n\nCase History:\n\nReason for Request: Pain and reduced mobility in skull region. Known osteoporosis. Rule out fracture.\n\nFrom clinical notes: Osteoporosis. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying osteoporosis. A fracture is identified in the skull region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Michael Chen, Consultant Radiologist 03/11/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_031",
    "input": {
      "report": "07/11/2025, 08:15, XR CEREBRO-SPINAL FLUID SHUNT\n\nCase History:\n\nReason for Request: Dry shunt tap, to assess shunt system prior to surgical exploration\n\nFindings: VP shunt tubing position as demonstrated no evidence of kink or fracture. No other significant abnormality.\n\nDr Sophie Richardson, Consultant Paediatric Radiologist GMC 5938274 07/11/2025, 12:30"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic"
    }
  },
  {
    "id": "rad_032",
    "input": {
      "report": "16/06/2025, 00:00, XR FEMUR\n\nCase History:\n\nReason for Request: Pain and reduced mobility in femur region. Known osteogenesis imperfecta. Rule out fracture.\n\nFrom clinical notes: Osteogenesis Imperfecta. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying osteogenesis imperfecta. A fracture is identified in the femur region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Oliver Matthews, Consultant Radiologist 16/06/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_033",
    "input": {
      "report": "09/06/2025, 00:00, CT PELVIS\n\nCase History:\n\nReason for Request: Follow-up imaging. Post-surgical evaluation.\n\nFindings: Post-operative changes noted. Degenerative changes only. No evidence of hardware complication. No pathological fracture. Stable appearance compared to prior.\n\nDr Laura Bennett, Consultant Radiologist 09/06/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_034",
    "input": {
      "report": "03/02/2025, 00:00, XR HUMERUS\n\nCase History:\n\nReason for Request: Follow-up imaging. Post-surgical evaluation.\n\nFindings: Post-operative changes noted. Old healed rib fracture. No evidence of hardware complication. No pathological fracture. Stable appearance compared to prior.\n\nDr Rachel Patel, Consultant Radiologist 03/02/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_035",
    "input": {
      "report": "24/04/2025, 00:00, MRI HUMERUS\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: Degenerative changes only. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Rachel Patel, Consultant Radiologist 24/04/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_036",
    "input": {
      "report": "24/06/2025, 00:00, CT SKULL\n\nCase History:\n\nReason for Request: Pain and reduced mobility in skull region. Known hyperparathyroidism. Rule out fracture.\n\nFrom clinical notes: Hyperparathyroidism. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying hyperparathyroidism. A fracture is identified in the skull region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Sarah Mitchell, Consultant Radiologist 24/06/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_037",
    "input": {
      "report": "30/12/2025, 00:00, MRI SKULL\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: No acute osseous abnormality. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Oliver Matthews, Consultant Radiologist 30/12/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_038",
    "input": {
      "report": "08/12/2025, 00:00, MRI FEMUR\n\nCase History:\n\nReason for Request: Pain and reduced mobility in femur region. Known vitamin D deficiency with bone demineralization. Rule out fracture.\n\nFrom clinical notes: Vitamin D Deficiency With Bone Demineralization. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying vitamin D deficiency with bone demineralization. A fracture is identified in the femur region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Oliver Matthews, Consultant Radiologist 08/12/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_039",
    "input": {
      "report": "13/11/2025, 00:00, CT SHOULDER\n\nCase History:\n\nReason for Request: Follow-up imaging. Post-surgical evaluation.\n\nFindings: Post-operative changes noted. No acute osseous abnormality. No evidence of hardware complication. No pathological fracture. Stable appearance compared to prior.\n\nDr Michael Chen, Consultant Radiologist 13/11/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_040",
    "input": {
      "report": "30/05/2025, 00:00, MRI SKULL\n\nCase History:\n\nReason for Request: Pain and reduced mobility in skull region. Known Paget's disease. Rule out fracture.\n\nFrom clinical notes: Paget'S Disease. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying Paget's disease. A fracture is identified in the skull region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Rachel Patel, Consultant Radiologist 30/05/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_041",
    "input": {
      "report": "11/10/2025, 00:00, MRI HUMERUS\n\nCase History:\n\nReason for Request: Pain and reduced mobility in humerus region. Known metabolic bone disease. Rule out fracture.\n\nFrom clinical notes: Metabolic Bone Disease. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying metabolic bone disease. A fracture is identified in the humerus region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Laura Bennett, Consultant Radiologist 11/10/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_042",
    "input": {
      "report": "29/03/2025, 00:00, CT PELVIS\n\nCase History:\n\nReason for Request: Pain and reduced mobility in pelvis region. Known osteogenesis imperfecta. Rule out fracture.\n\nFrom clinical notes: Osteogenesis Imperfecta. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying osteogenesis imperfecta. A fracture is identified in the pelvis region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Michael Chen, Consultant Radiologist 29/03/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_043",
    "input": {
      "report": "02/04/2025, 00:00, CT HUMERUS\n\nCase History:\n\nReason for Request: Pain and reduced mobility in humerus region. Known multiple myeloma. Rule out fracture.\n\nFrom clinical notes: Multiple Myeloma. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying multiple myeloma. A fracture is identified in the humerus region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Emma Patterson, Consultant Radiologist 02/04/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_044",
    "input": {
      "report": "03/02/2025, 00:00, XR SHOULDER\n\nCase History:\n\nReason for Request: Pain and reduced mobility in shoulder region. Known bone metastases. Rule out fracture.\n\nFrom clinical notes: Bone Metastases. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying bone metastases. A fracture is identified in the shoulder region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Catherine Reynolds, Consultant Radiologist 03/02/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_045",
    "input": {
      "report": "20/02/2025, 00:00, XR WRIST\n\nCase History:\n\nReason for Request: Pain and reduced mobility in wrist region. Known Paget's disease. Rule out fracture.\n\nFrom clinical notes: Paget'S Disease. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying Paget's disease. A fracture is identified in the wrist region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Emma Patterson, Consultant Radiologist 20/02/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_046",
    "input": {
      "report": "22/09/2025, 00:00, CT SKULL\n\nCase History:\n\nReason for Request: Trauma assessment. Rule out fracture.\n\nFindings: Old healed rib fracture. No acute bone injury. Soft tissues unremarkable. Joint spaces preserved.\n\nDr Oliver Matthews, Consultant Radiologist 22/09/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_047",
    "input": {
      "report": "02/06/2025, 00:00, XR SPINE\n\nCase History:\n\nReason for Request: Follow-up imaging. Post-surgical evaluation.\n\nFindings: Post-operative changes noted. Old healed rib fracture. No evidence of hardware complication. No pathological fracture. Stable appearance compared to prior.\n\nDr Oliver Matthews, Consultant Radiologist 02/06/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_048",
    "input": {
      "report": "09/12/2025, 00:00, MRI CHEST\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: Stable appearance. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Michael Chen, Consultant Radiologist 09/12/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_049",
    "input": {
      "report": "19/10/2025, 14:25, CT HEAD\n\nCase History:\n\nReason for Request: 18 mo, drowsy, drop GCS 12/15 - ? changes ICP - bradycardia, hypertension and reduced conscious level\n\nFindings and interpretation: Non-contrast CT head. No previous relevant imaging available for comparison at time of reporting. The patient was scanned using a vacuum immobilisation bag due to motion concerns. This results in a linear artefact in the anteroposterior direction, most evident at the level of the corona radiata and posterior fossa, limiting assessment in these regions -Within the above limitation, no evidence of acute intracranial haemorrhage or established territorial infarction. -No midline shift or signs of transtentorial or uncal herniation. -The foramen magnum is capacious, with no tonsillar herniation. -No acute calvarial fracture is identified. -Ventricular size and configuration are within normal limits. -No hydrocephalus or sulcal effacement.\n\nOpinion: No acute intracranial haemorrhage, infarction, or herniation identified within the limitations of linear artefact from the immobilisation bag. No acute calvarial fracture.\n\nDr Oliver Matthews, Radiology Registrar ST4 Approved by Dr Rachel Patel, Consultant Neuroradiologist GMC-8126745 19/10/2025, 15:52"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic"
    }
  },
  {
    "id": "rad_050",
    "input": {
      "report": "14/10/2025, 00:00, MRI SHOULDER\n\nCase History:\n\nReason for Request: Pain and reduced mobility in shoulder region. Known renal osteodystrophy. Rule out fracture.\n\nFrom clinical notes: Renal Osteodystrophy. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying renal osteodystrophy. A fracture is identified in the shoulder region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Laura Bennett, Consultant Radiologist 14/10/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_051",
    "input": {
      "report": "29/12/2025, 00:00, XR SPINE\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: No evidence of fracture or dislocation. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Michael Chen, Consultant Radiologist 29/12/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_052",
    "input": {
      "report": "05/07/2025, 00:00, MRI TIBIA\n\nCase History:\n\nReason for Request: Pain and reduced mobility in tibia region. Known metabolic bone disease. Rule out fracture.\n\nFrom clinical notes: Metabolic Bone Disease. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying metabolic bone disease. A fracture is identified in the tibia region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Michael Chen, Consultant Radiologist 05/07/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_053",
    "input": {
      "report": "15/07/2025, 14:22, XR PELVIS AND HIPS BOTH\n\nCase History:\n\nReason for Request: Patient with known osteoporosis presenting with acute onset right hip pain following minor fall. Unable to weight bear. ? Fracture\n\nFrom clinical notes: Type 2 diabetes mellitus. Chronic kidney disease stage 3. Vitamin D deficiency.\n\nFindings: Compared to 10/05/2025. There is generalised osteopenia throughout the visualised bones consistent with known metabolic bone disease. A non-displaced fracture is identified through the right femoral neck with surrounding sclerosis suggesting chronicity of approximately 2-3 weeks. The left hip appears intact with no acute fracture. No significant joint effusion. Mild degenerative changes noted at both sacroiliac joints. Soft tissue calcification noted in the right gluteal region, likely vascular in nature. The visualised lower lumbar spine demonstrates reduced bone density with compression deformity of L4 vertebral body. Orthopaedic review recommended for management of femoral neck fracture.\n\nDr Sarah Mitchell, Consultant Radiologist 15/07/2025, 16:45"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic"
    }
  },
  {
    "id": "rad_054",
    "input": {
      "report": "06/09/2025, 00:00, XR WRIST\n\nCase History:\n\nReason for Request: Pain and reduced mobility in wrist region. Known hyperparathyroidism. Rule out fracture.\n\nFrom clinical notes: Hyperparathyroidism. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying hyperparathyroidism. A fracture is identified in the wrist region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Michael Chen, Consultant Radiologist 06/09/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_055",
    "input": {
      "report": "29/06/2025, 00:00, CT HUMERUS\n\nCase History:\n\nReason for Request: Pain and reduced mobility in humerus region. Known multiple myeloma. Rule out fracture.\n\nFrom clinical notes: Multiple Myeloma. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying multiple myeloma. A fracture is identified in the humerus region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Oliver Matthews, Consultant Radiologist 29/06/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_056",
    "input": {
      "report": "24/03/2025, 00:00, MRI SKULL\n\nCase History:\n\nReason for Request: Pain and reduced mobility in skull region. Known renal osteodystrophy. Rule out fracture.\n\nFrom clinical notes: Renal Osteodystrophy. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying renal osteodystrophy. A fracture is identified in the skull region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Sarah Mitchell, Consultant Radiologist 24/03/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_057",
    "input": {
      "report": "13/08/2025, 00:00, MRI SKULL\n\nCase History:\n\nReason for Request: Trauma assessment. Rule out fracture.\n\nFindings: Stable appearance. No acute bone injury. Soft tissues unremarkable. Joint spaces preserved.\n\nDr Laura Bennett, Consultant Radiologist 13/08/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_058",
    "input": {
      "report": "06/01/2025, 00:00, CT PELVIS\n\nCase History:\n\nReason for Request: Follow-up imaging. Post-surgical evaluation.\n\nFindings: Post-operative changes noted. Degenerative changes only. No evidence of hardware complication. No pathological fracture. Stable appearance compared to prior.\n\nDr Rachel Patel, Consultant Radiologist 06/01/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_059",
    "input": {
      "report": "22/03/2025, 00:00, XR WRIST\n\nCase History:\n\nReason for Request: Pain and reduced mobility in wrist region. Known metastatic disease. Rule out fracture.\n\nFrom clinical notes: Metastatic Disease. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying metastatic disease. A fracture is identified in the wrist region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Michael Chen, Consultant Radiologist 22/03/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_060",
    "input": {
      "report": "01/08/2025, 00:00, CT HUMERUS\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: Healing fracture from previous trauma. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr James Harrison, Consultant Radiologist 01/08/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_061",
    "input": {
      "report": "15/03/2025, 00:00, CT ANKLE\n\nCase History:\n\nReason for Request: Pain and reduced mobility in ankle region. Known renal osteodystrophy. Rule out fracture.\n\nFrom clinical notes: Renal Osteodystrophy. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying renal osteodystrophy. A fracture is identified in the ankle region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Michael Chen, Consultant Radiologist 15/03/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_062",
    "input": {
      "report": "14/09/2025, 11:35, XR HUMERUS LEFT 14/09/2025, 11:34, XR HUMERUS RIGHT\n\nCase History:\n\nReason for Request: reduced range of motion, new per physiotherapist concern, ? fracture, Rt arm stricture? injury, weakness, to rule out fracture\n\nFindings: Symmetrical appearances with broad-based diaphyseal periosteal reaction bilaterally of both humeri, likely physiological. There are similar findings in the proximal right radius and ulna. The proximal humeral ossification centre appears symmetrical. No acute bony injury.\n\nDr Catherine Reynolds MRCP FRCR, Consultant Paediatric Radiologist GMC:6847293 14/09/2025, 12:10"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic"
    }
  },
  {
    "id": "rad_063",
    "input": {
      "report": "25/08/2025, 13:45, XR ABDOMEN\n\nCase History:\n\nReason for Request: Abdominal distention and worsening discomfort /pain over the last 24 hrs related to feeds - BG : day 5 post PEG insertion\n\nFindings: Gastrostomy noted. Right-sided VP shunt tubing coiled within the abdomen with tip projected over the right flank, no kink or fracture demonstrated. Bowel gas pattern is unremarkable with no evidence of obstruction. No definitive pneumatasis or free intraperitoneal gas.\n\nDr Laura Bennett, Consultant Paediatric Radiologist GMC number: 7294816 25/08/2025, 14:02"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic"
    }
  },
  {
    "id": "rad_064",
    "input": {
      "report": "30/04/2025, 00:00, CT SKULL\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: Old healed rib fracture. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Laura Bennett, Consultant Radiologist 30/04/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_065",
    "input": {
      "report": "25/09/2025, 00:00, CT WRIST\n\nCase History:\n\nReason for Request: Trauma assessment. Rule out fracture.\n\nFindings: Old healed rib fracture. No acute bone injury. Soft tissues unremarkable. Joint spaces preserved.\n\nDr Sarah Mitchell, Consultant Radiologist 25/09/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_066",
    "input": {
      "report": "29/03/2025, 00:00, CT HUMERUS\n\nCase History:\n\nReason for Request: Pain and reduced mobility in humerus region. Known osteoporosis. Rule out fracture.\n\nFrom clinical notes: Osteoporosis. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying osteoporosis. A fracture is identified in the humerus region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Catherine Reynolds, Consultant Radiologist 29/03/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_067",
    "input": {
      "report": "20/12/2025, 00:00, MRI SKULL\n\nCase History:\n\nReason for Request: Follow-up imaging. Post-surgical evaluation.\n\nFindings: Post-operative changes noted. No acute osseous abnormality. No evidence of hardware complication. No pathological fracture. Stable appearance compared to prior.\n\nDr Rachel Patel, Consultant Radiologist 20/12/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_068",
    "input": {
      "report": "19/09/2025, 00:00, XR CHEST\n\nCase History:\n\nReason for Request: Pain and reduced mobility in chest region. Known bone metastases. Rule out fracture.\n\nFrom clinical notes: Bone Metastases. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying bone metastases. A fracture is identified in the chest region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr James Harrison, Consultant Radiologist 19/09/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_069",
    "input": {
      "report": "03/02/2025, 00:00, CT ANKLE\n\nCase History:\n\nReason for Request: Trauma assessment. Rule out fracture.\n\nFindings: No evidence of fracture or dislocation. No acute bone injury. Soft tissues unremarkable. Joint spaces preserved.\n\nDr James Harrison, Consultant Radiologist 03/02/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_070",
    "input": {
      "report": "11/05/2025, 00:00, CT SHOULDER\n\nCase History:\n\nReason for Request: Pain and reduced mobility in shoulder region. Known metabolic bone disease. Rule out fracture.\n\nFrom clinical notes: Metabolic Bone Disease. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying metabolic bone disease. A fracture is identified in the shoulder region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Catherine Reynolds, Consultant Radiologist 11/05/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_071",
    "input": {
      "report": "22/09/2025, 11:40, XR FEMUR LEFT 22/09/2025, 11:32, XR TIBIA AND FIBULA LEFT\n\nCase History:\n\nReason for Request: New onset pain / guarding/ resisting movement of left leg - painful on examination of lower tibia and ankle (left)\n\n? Fracture, New onset pain / guarding/ resisting movement of left leg - painful on examination of lower tibia and ankle (left) ? Fracture From clinical notes: Osteogenesis imperfecta type III. Secondary hyperparathyroidism. Previous multiple fractures. Chronic kidney disease stage 4, Vitamin D deficiency, Mobility impairment.\n\nFindings: There is diffuse osteopenia in keeping with known hyperparathyroidism. There are transverse fractures of the distal left femur, proximal and distal left tibia and fibula, with some adjacent periosteal reaction but minimal displacement. These represents pathological fractures which occurred several days ago, in a patient with pre-existing metabolic bone disease. An orthopaedic opinion regarding alignment should be considered. Dr Rebecca Thompson, Consultant Radiologist 22/09/2025, 13:15"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic"
    }
  },
  {
    "id": "rad_072",
    "input": {
      "report": "12/03/2025, 00:00, MRI SHOULDER\n\nCase History:\n\nReason for Request: Trauma assessment. Rule out fracture.\n\nFindings: Healing fracture from previous trauma. No acute bone injury. Soft tissues unremarkable. Joint spaces preserved.\n\nDr Sophie Richardson, Consultant Radiologist 12/03/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_073",
    "input": {
      "report": "10/10/2025, 00:00, MRI ANKLE\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: No acute fracture identified. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Rebecca Thompson, Consultant Radiologist 10/10/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_074",
    "input": {
      "report": "24/02/2025, 00:00, MRI SPINE\n\nCase History:\n\nReason for Request: Trauma assessment. Rule out fracture.\n\nFindings: Degenerative changes only. No acute bone injury. Soft tissues unremarkable. Joint spaces preserved.\n\nDr James Harrison, Consultant Radiologist 24/02/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_075",
    "input": {
      "report": "03/05/2025, 00:00, MRI SKULL\n\nCase History:\n\nReason for Request: Pain and reduced mobility in skull region. Known multiple myeloma. Rule out fracture.\n\nFrom clinical notes: Multiple Myeloma. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying multiple myeloma. A fracture is identified in the skull region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Oliver Matthews, Consultant Radiologist 03/05/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_076",
    "input": {
      "report": "18/12/2025, 00:00, XR SKULL\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: No acute fracture identified. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Sophie Richardson, Consultant Radiologist 18/12/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_077",
    "input": {
      "report": "26/06/2025, 00:00, MRI CHEST\n\nCase History:\n\nReason for Request: Pain and reduced mobility in chest region. Known osteogenesis imperfecta. Rule out fracture.\n\nFrom clinical notes: Osteogenesis Imperfecta. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying osteogenesis imperfecta. A fracture is identified in the chest region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Oliver Matthews, Consultant Radiologist 26/06/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_078",
    "input": {
      "report": "04/04/2025, 00:00, CT HUMERUS\n\nCase History:\n\nReason for Request: Trauma assessment. Rule out fracture.\n\nFindings: No evidence of fracture or dislocation. No acute bone injury. Soft tissues unremarkable. Joint spaces preserved.\n\nDr Laura Bennett, Consultant Radiologist 04/04/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_079",
    "input": {
      "report": "29/10/2025, 00:00, XR PELVIS\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: Bones appear intact. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Laura Bennett, Consultant Radiologist 29/10/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_080",
    "input": {
      "report": "10/10/2025, 00:00, MRI HUMERUS\n\nCase History:\n\nReason for Request: Trauma assessment. Rule out fracture.\n\nFindings: No acute fracture identified. No acute bone injury. Soft tissues unremarkable. Joint spaces preserved.\n\nDr Rachel Patel, Consultant Radiologist 10/10/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_081",
    "input": {
      "report": "01/01/2025, 00:00, XR HUMERUS\n\nCase History:\n\nReason for Request: Follow-up imaging. Post-surgical evaluation.\n\nFindings: Post-operative changes noted. No acute osseous abnormality. No evidence of hardware complication. No pathological fracture. Stable appearance compared to prior.\n\nDr James Harrison, Consultant Radiologist 01/01/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_082",
    "input": {
      "report": "23/10/2025, 00:00, XR SHOULDER\n\nCase History:\n\nReason for Request: Pain and reduced mobility in shoulder region. Known osteoporosis. Rule out fracture.\n\nFrom clinical notes: Osteoporosis. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying osteoporosis. A fracture is identified in the shoulder region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Rebecca Thompson, Consultant Radiologist 23/10/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_083",
    "input": {
      "report": "02/10/2025, 00:00, MRI HUMERUS\n\nCase History:\n\nReason for Request: Pain and reduced mobility in humerus region. Known vitamin D deficiency with bone demineralization. Rule out fracture.\n\nFrom clinical notes: Vitamin D Deficiency With Bone Demineralization. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying vitamin D deficiency with bone demineralization. A fracture is identified in the humerus region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Rachel Patel, Consultant Radiologist 02/10/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_084",
    "input": {
      "report": "24/05/2025, 00:00, XR WRIST\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: Degenerative changes only. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Michael Chen, Consultant Radiologist 24/05/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_085",
    "input": {
      "report": "28/10/2025, 00:00, CT SHOULDER\n\nCase History:\n\nReason for Request: Trauma assessment. Rule out fracture.\n\nFindings: Stable appearance. No acute bone injury. Soft tissues unremarkable. Joint spaces preserved.\n\nDr Catherine Reynolds, Consultant Radiologist 28/10/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_086",
    "input": {
      "report": "18/07/2025, 09:30, CT THORAX WITH CONTRAST\n\nCase History:\n\nReason for Request: Discussion in MDT regarding Lung Pathology\n\nFindings: ASD and VSD noted, with markedly dilated right atrium. Pulmonary veins are broadly patent. The lungs are of large volume. There are bands of atelectasis in both lower lobes. There is slight hyperlucency of the left lung apex with slight rightward displacement of the anterior junction line suggesting some localised overinflation. The central airways are patent. No lung cysts. There is a healing fracture of the posterolateral aspect of the right 9th rib. Subtle callus formation is probably visible on chest radiograph dated 16/07/2025, but not on prior radiographs.\n\nConclusion:\n\nLarge volume lungs with some atelectasis, some focal hyperinflation in left upper lobe. Findings may reflect infection eg bronchiolitis, but in the context aspiration may also be considered. Incidentally demonstrated healing fracture of the right 9th posterolateral rib. This was demonstrable in retrospect on the radiograph dated 16/07/2025 but not prior. It is unlikely this fracture was sustained more than 10 days prior to the last radiograph where fracture not visible (13th July), ie not before 3rd July, and therefore likely sustained during the current admission. Alert raised for incidental rib fracture.\n\n--------------\nHOSPITAL ALERT This imaging examination has an UNEXPECTED FINDING and needs your review. REVIEW THE IMAGE AND REPORT and take any ACTION necessary. You can then CLICK Done, Acknowledge or Mark as Reviewed.\n-------------\n\nDr James Harrison, Consultant Radiologist 18/07/2025, 10:15 GMC 5873421"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic"
    }
  },
  {
    "id": "rad_087",
    "input": {
      "report": "16/10/2025, 00:00, CT SKULL\n\nCase History:\n\nReason for Request: Pain and reduced mobility in skull region. Known metabolic bone disease. Rule out fracture.\n\nFrom clinical notes: Metabolic Bone Disease. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying metabolic bone disease. A fracture is identified in the skull region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Catherine Reynolds, Consultant Radiologist 16/10/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_088",
    "input": {
      "report": "02/09/2025, 00:00, CT PELVIS\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: No acute fracture identified. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Rebecca Thompson, Consultant Radiologist 02/09/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_089",
    "input": {
      "report": "04/02/2025, 00:00, XR ANKLE\n\nCase History:\n\nReason for Request: Pain and reduced mobility in ankle region. Known renal osteodystrophy. Rule out fracture.\n\nFrom clinical notes: Renal Osteodystrophy. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying renal osteodystrophy. A fracture is identified in the ankle region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Rebecca Thompson, Consultant Radiologist 04/02/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_090",
    "input": {
      "report": "10/10/2025, 00:00, CT PELVIS\n\nCase History:\n\nReason for Request: Follow-up imaging. Post-surgical evaluation.\n\nFindings: Post-operative changes noted. Bones appear intact. No evidence of hardware complication. No pathological fracture. Stable appearance compared to prior.\n\nDr Laura Bennett, Consultant Radiologist 10/10/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_091",
    "input": {
      "report": "29/01/2025, 00:00, MRI SPINE\n\nCase History:\n\nReason for Request: Trauma assessment. Rule out fracture.\n\nFindings: Stable appearance. No acute bone injury. Soft tissues unremarkable. Joint spaces preserved.\n\nDr Michael Chen, Consultant Radiologist 29/01/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_092",
    "input": {
      "report": "15/05/2025, 00:00, MRI FEMUR\n\nCase History:\n\nReason for Request: Pain and reduced mobility in femur region. Known renal osteodystrophy. Rule out fracture.\n\nFrom clinical notes: Renal Osteodystrophy. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying renal osteodystrophy. A fracture is identified in the femur region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Michael Chen, Consultant Radiologist 15/05/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_093",
    "input": {
      "report": "12/06/2025, 00:00, CT SPINE\n\nCase History:\n\nReason for Request: Pain and reduced mobility in spine region. Known Paget's disease. Rule out fracture.\n\nFrom clinical notes: Paget'S Disease. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying Paget's disease. A fracture is identified in the spine region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Rebecca Thompson, Consultant Radiologist 12/06/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_094",
    "input": {
      "report": "17/07/2025, 00:00, XR PELVIS\n\nCase History:\n\nReason for Request: Pain and reduced mobility in pelvis region. Known bone metastases. Rule out fracture.\n\nFrom clinical notes: Bone Metastases. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying bone metastases. A fracture is identified in the pelvis region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Laura Bennett, Consultant Radiologist 17/07/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_095",
    "input": {
      "report": "17/09/2025, 00:00, XR SKULL\n\nCase History:\n\nReason for Request: Pain and reduced mobility in skull region. Known Paget's disease. Rule out fracture.\n\nFrom clinical notes: Paget'S Disease. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying Paget's disease. A fracture is identified in the skull region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Rachel Patel, Consultant Radiologist 17/09/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_096",
    "input": {
      "report": "27/10/2025, 00:00, CT SKULL\n\nCase History:\n\nReason for Request: Pain and reduced mobility in skull region. Known metabolic bone disease. Rule out fracture.\n\nFrom clinical notes: Metabolic Bone Disease. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying metabolic bone disease. A fracture is identified in the skull region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Sarah Mitchell, Consultant Radiologist 27/10/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_097",
    "input": {
      "report": "04/10/2025, 00:00, XR WRIST\n\nCase History:\n\nReason for Request: Routine evaluation. Query abnormality.\n\nFindings: No acute osseous abnormality. Bone density within normal limits. No lytic or sclerotic lesions. No fracture or dislocation.\n\nDr Emma Patterson, Consultant Radiologist 04/10/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_098",
    "input": {
      "report": "12/06/2025, 10:22, XR FOOT RIGHT\n\nCase History:\n\nReason for Request: Small swelling over medial dorsal side right foot and along 1st metatarsal of great toe; pain upon palpation of this area. Known reduced bone density, previous fracture in arm - rule out fracture\n\nFindings: There is moderate osteopenia. There is a possible Salter Harris II fracture of the proximal lateral aspect of the 1st metatarsal although this is not clearly shown on the lateral view. An oblique view may help to clarify.\n\nDr Emma Patterson, Consultant Radiologist 12/06/2025, 11:45 GMC 6542189"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic"
    }
  },
  {
    "id": "rad_099",
    "input": {
      "report": "28/11/2025, 00:00, MRI TIBIA\n\nCase History:\n\nReason for Request: Pain and reduced mobility in tibia region. Known osteoporosis. Rule out fracture.\n\nFrom clinical notes: Osteoporosis. Previous history of fragility fractures.\n\nFindings: There is diffuse osteopenia consistent with underlying osteoporosis. A fracture is identified in the tibia region with periosteal reaction suggesting pathological nature. The fracture pattern is consistent with insufficiency fracture in the context of metabolic bone disease. Surrounding soft tissues appear unremarkable. Recommend orthopedic consultation.\n\nDr Oliver Matthews, Consultant Radiologist 28/11/2025, 00:00"
    },
    "output": {
      "pathological_fracture": true
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  },
  {
    "id": "rad_100",
    "input": {
      "report": "18/07/2025, 00:00, XR ANKLE\n\nCase History:\n\nReason for Request: Trauma assessment. Rule out fracture.\n\nFindings: No acute osseous abnormality. No acute bone injury. Soft tissues unremarkable. Joint spaces preserved.\n\nDr Sophie Richardson, Consultant Radiologist 18/07/2025, 00:00"
    },
    "output": {
      "pathological_fracture": false
    },
    "metadata": {
      "source": "synthetic_generated"
    }
  }
]
